UNIT_CASES = {
  "метр": {
    "sing": {
      "nomn": "метр",
      "gent": "метра",
      "datv": "метру",
      "accs": "метр",
      "ablt": "метром",
      "loct": "метре"
    },
    "plur": {
      "nomn": "метры",
      "gent": "метров",
      "datv": "метрам",
      "accs": "метры",
      "ablt": "метрами",
      "loct": "метрах"
    }
  },
  "километр": {
    "sing": {
      "nomn": "километр",
      "gent": "километра",
      "datv": "километру",
      "accs": "километр",
      "ablt": "километром",
      "loct": "километре"
    },
    "plur": {
      "nomn": "километры",
      "gent": "километров",
      "datv": "километрам",
      "accs": "километры",
      "ablt": "километрами",
      "loct": "километрах"
    }
  },
  "сантиметр": {
    "sing": {
      "nomn": "сантиметр",
      "gent": "сантиметра",
      "datv": "сантиметру",
      "accs": "сантиметр",
      "ablt": "сантиметром",
      "loct": "сантиметре"
    },
    "plur": {
      "nomn": "сантиметры",
      "gent": "сантиметров",
      "datv": "сантиметрам",
      "accs": "сантиметры",
      "ablt": "сантиметрами",
      "loct": "сантиметрах"
    }
  },
  "миллиметр": {
    "sing": {
      "nomn": "миллиметр",
      "gent": "миллиметра",
      "datv": "миллиметру",
      "accs": "миллиметр",
      "ablt": "миллиметром",
      "loct": "миллиметре"
    },
    "plur": {
      "nomn": "миллиметры",
      "gent": "миллиметров",
      "datv": "миллиметрам",
      "accs": "миллиметры",
      "ablt": "миллиметрами",
      "loct": "миллиметрах"
    }
  },
  "микрометр": {
    "sing": {
      "nomn": "микрометр",
      "gent": "микрометра",
      "datv": "микрометру",
      "accs": "микрометр",
      "ablt": "микрометром",
      "loct": "микрометре"
    },
    "plur": {
      "nomn": "микрометры",
      "gent": "микрометров",
      "datv": "микрометрам",
      "accs": "микрометры",
      "ablt": "микрометрами",
      "loct": "микрометрах"
    }
  },
  "нанометр": {
    "sing": {
      "nomn": "нанометр",
      "gent": "нанометра",
      "datv": "нанометру",
      "accs": "нанометр",
      "ablt": "нанометром",
      "loct": "нанометре"
    },
    "plur": {
      "nomn": "нанометры",
      "gent": "нанометров",
      "datv": "нанометрам",
      "accs": "нанометры",
      "ablt": "нанометрами",
      "loct": "нанометрах"
    }
  },
  "секунда": {
    "sing": {
      "nomn": "секунда",
      "gent": "секунды",
      "datv": "секунде",
      "accs": "секунду",
      "ablt": "секундой",
      "loct": "секунде"
    },
    "plur": {
      "nomn": "секунды",
      "gent": "секунд",
      "datv": "секундам",
      "accs": "секунды",
      "ablt": "секундами",
      "loct": "секундах"
    }
  },
  "минута": {
    "sing": {
      "nomn": "минута",
      "gent": "минуты",
      "datv": "минуте",
      "accs": "минуту",
      "ablt": "минутой",
      "loct": "минуте"
    },
    "plur": {
      "nomn": "минуты",
      "gent": "минут",
      "datv": "минутам",
      "accs": "минуты",
      "ablt": "минутами",
      "loct": "минутах"
    }
  },
  "час": {
    "sing": {
      "nomn": "час",
      "gent": "часа",
      "datv": "часу",
      "accs": "час",
      "ablt": "часом",
      "loct": "часе"
    },
    "plur": {
      "nomn": "часы",
      "gent": "часов",
      "datv": "часам",
      "accs": "часы",
      "ablt": "часами",
      "loct": "часах"
    }
  },
  "день": {
    "sing": {
      "nomn": "день",
      "gent": "дня",
      "datv": "дню",
      "accs": "день",
      "ablt": "днём",
      "loct": "дне"
    },
    "plur": {
      "nomn": "дни",
      "gent": "дней",
      "datv": "дням",
      "accs": "дни",
      "ablt": "днями",
      "loct": "днях"
    }
  },
  "неделя": {
    "sing": {
      "nomn": "неделя",
      "gent": "недели",
      "datv": "неделе",
      "accs": "неделю",
      "ablt": "неделей",
      "loct": "неделе"
    },
    "plur": {
      "nomn": "недели",
      "gent": "недель",
      "datv": "неделям",
      "accs": "недели",
      "ablt": "неделями",
      "loct": "неделях"
    }
  },
  "миллисекунда": {
    "sing": {
      "nomn": "миллисекунда",
      "gent": "миллисекунды",
      "datv": "миллисекунде",
      "accs": "миллисекунду",
      "ablt": "миллисекундой",
      "loct": "миллисекунде"
    },
    "plur": {
      "nomn": "миллисекунды",
      "gent": "миллисекунд",
      "datv": "миллисекундам",
      "accs": "миллисекунды",
      "ablt": "миллисекундами",
      "loct": "миллисекундах"
    }
  },
  "микросекунда": {
    "sing": {
      "nomn": "микросекунда",
      "gent": "микросекунды",
      "datv": "микросекунде",
      "accs": "микросекунду",
      "ablt": "микросекундой",
      "loct": "микросекунде"
    },
    "plur": {
      "nomn": "микросекунды",
      "gent": "микросекунд",
      "datv": "микросекундам",
      "accs": "микросекунды",
      "ablt": "микросекундами",
      "loct": "микросекундах"
    }
  },
  "наносекунда": {
    "sing": {
      "nomn": "наносекунда",
      "gent": "наносекунды",
      "datv": "наносекунде",
      "accs": "наносекунду",
      "ablt": "наносекундой",
      "loct": "наносекунде"
    },
    "plur": {
      "nomn": "наносекунды",
      "gent": "наносекунд",
      "datv": "наносекундам",
      "accs": "наносекунды",
      "ablt": "наносекундами",
      "loct": "наносекундах"
    }
  },
  "год": {
    "sing": {
      "nomn": "год",
      "gent": "года",
      "datv": "году",
      "accs": "год",
      "ablt": "годом",
      "loct": "годе"
    },
    "plur": {
      "nomn": "годы",
      "gent": "годов",
      "datv": "годам",
      "accs": "годы",
      "ablt": "годами",
      "loct": "годах"
    }
  },
  "десятилетие": {
    "sing": {
      "nomn": "десятилетие",
      "gent": "десятилетия",
      "datv": "десятилетию",
      "accs": "десятилетие",
      "ablt": "десятилетием",
      "loct": "десятилетии"
    },
    "plur": {
      "nomn": "десятилетия",
      "gent": "десятилетий",
      "datv": "десятилетиям",
      "accs": "десятилетия",
      "ablt": "десятилетиями",
      "loct": "десятилетиях"
    }
  },
  "век": {
    "sing": {
      "nomn": "век",
      "gent": "века",
      "datv": "веку",
      "accs": "век",
      "ablt": "веком",
      "loct": "веке"
    },
    "plur": {
      "nomn": "века",
      "gent": "веков",
      "datv": "векам",
      "accs": "века",
      "ablt": "веками",
      "loct": "веках"
    }
  },
  "тысячелетие": {
    "sing": {
      "nomn": "тысячелетие",
      "gent": "тысячелетия",
      "datv": "тысячелетию",
      "accs": "тысячелетие",
      "ablt": "тысячелетием",
      "loct": "тысячелетии"
    },
    "plur": {
      "nomn": "тысячелетия",
      "gent": "тысячелетий",
      "datv": "тысячелетиям",
      "accs": "тысячелетия",
      "ablt": "тысячелетиями",
      "loct": "тысячелетиях"
    }
  },
  "месяц": {
    "sing": {
      "nomn": "месяц",
      "gent": "месяца",
      "datv": "месяцу",
      "accs": "месяц",
      "ablt": "месяцем",
      "loct": "месяце"
    },
    "plur": {
      "nomn": "месяцы",
      "gent": "месяцев",
      "datv": "месяцам",
      "accs": "месяцы",
      "ablt": "месяцами",
      "loct": "месяцах"
    }
  },
  "килограмм": {
    "sing": {
      "nomn": "килограмм",
      "gent": "килограмма",
      "datv": "килограмму",
      "accs": "килограмм",
      "ablt": "килограммом",
      "loct": "килограмме"
    },
    "plur": {
      "nomn": "килограммы",
      "gent": "килограммов",
      "datv": "килограммам",
      "accs": "килограммы",
      "ablt": "килограммами",
      "loct": "килограммах"
    }
  },
  "тонна": {
    "sing": {
      "nomn": "тонна",
      "gent": "тонны",
      "datv": "тонне",
      "accs": "тонну",
      "ablt": "тонной",
      "loct": "тонне"
    },
    "plur": {
      "nomn": "тонны",
      "gent": "тонн",
      "datv": "тоннам",
      "accs": "тонны",
      "ablt": "тоннами",
      "loct": "тоннах"
    }
  },
  "грамм": {
    "sing": {
      "nomn": "грамм",
      "gent": "грамма",
      "datv": "грамму",
      "accs": "грамм",
      "ablt": "граммом",
      "loct": "грамме"
    },
    "plur": {
      "nomn": "граммы",
      "gent": "граммов",
      "datv": "граммам",
      "accs": "граммы",
      "ablt": "граммами",
      "loct": "граммах"
    }
  },
  "миллиграмм": {
    "sing": {
      "nomn": "миллиграмм",
      "gent": "миллиграмма",
      "datv": "миллиграмму",
      "accs": "миллиграмм",
      "ablt": "миллиграммом",
      "loct": "миллиграмме"
    },
    "plur": {
      "nomn": "миллиграммы",
      "gent": "миллиграммов",
      "datv": "миллиграммам",
      "accs": "миллиграммы",
      "ablt": "миллиграммами",
      "loct": "миллиграммах"
    }
  },
  "микрограмм": {
    "sing": {
      "nomn": "микрограмм",
      "gent": "микрограмма",
      "datv": "микрограмму",
      "accs": "микрограмм",
      "ablt": "микрограммом",
      "loct": "микрограмме"
    },
    "plur": {
      "nomn": "микрограммы",
      "gent": "микрограммов",
      "datv": "микрограммам",
      "accs": "микрограммы",
      "ablt": "микрограммами",
      "loct": "микрограммах"
    }
  },
  "нанограмм": {
    "sing": {
      "nomn": "нанограмм",
      "gent": "нанограмма",
      "datv": "нанограмму",
      "accs": "нанограмм",
      "ablt": "нанограммом",
      "loct": "нанограмме"
    },
    "plur": {
      "nomn": "нанограммы",
      "gent": "нанограммов",
      "datv": "нанограммам",
      "accs": "нанограммы",
      "ablt": "нанограммами",
      "loct": "нанограммах"
    }
  },
  "литр": {
    "sing": {
      "nomn": "литр",
      "gent": "литра",
      "datv": "литру",
      "accs": "литр",
      "ablt": "литром",
      "loct": "литре"
    },
    "plur": {
      "nomn": "литры",
      "gent": "литров",
      "datv": "литрам",
      "accs": "литры",
      "ablt": "литрами",
      "loct": "литрах"
    }
  },
  "миллилитр": {
    "sing": {
      "nomn": "миллилитр",
      "gent": "миллилитра",
      "datv": "миллилитру",
      "accs": "миллилитр",
      "ablt": "миллилитром",
      "loct": "миллилитре"
    },
    "plur": {
      "nomn": "миллилитры",
      "gent": "миллилитров",
      "datv": "миллилитрам",
      "accs": "миллилитры",
      "ablt": "миллилитрами",
      "loct": "миллилитрах"
    }
  }
}


RUNUMB = {
  0: {
    "nomn": "ноль",
    "gent": "нуля",
    "datv": "нулю",
    "accs": "нуль",
    "ablt": "нулями",
    "loct": "нулях"
  },
  "2": {
    "nomn": "два",
    "gent": "двух",
    "datv": "двум",
    "accs": "два",
    "ablt": "двумя",
    "loct": "двух"
  },
  "3": {
    "nomn": "три",
    "gent": "трёх",
    "datv": "трём",
    "accs": "трёх",
    "ablt": "тремя",
    "loct": "трёх"
  },
  "4": {
    "nomn": "четыре",
    "gent": "четырёх",
    "datv": "четырём",
    "accs": "четыре",
    "ablt": "четырьмя",
    "loct": "четырёх"
  },
  "5": {
    "nomn": "пять",
    "gent": "пяти",
    "datv": "пяти",
    "accs": "пять",
    "ablt": "пятью",
    "loct": "пяти"
  },
  "6": {
    "nomn": "шесть",
    "gent": "шести",
    "datv": "шести",
    "accs": "шесть",
    "ablt": "шестью",
    "loct": "шести"
  },
  "7": {
    "nomn": "семь",
    "gent": "семи",
    "datv": "семи",
    "accs": "семь",
    "ablt": "семью",
    "loct": "семи"
  },
  "8": {
    "nomn": "восемь",
    "gent": "восьми",
    "datv": "восьми",
    "accs": "восемь",
    "ablt": "восемью",
    "loct": "восьми"
  },
  "9": {
    "nomn": "девять",
    "gent": "девяти",
    "datv": "девяти",
    "accs": "девять",
    "ablt": "девятью",
    "loct": "девяти"
  },
  "10": {
    "nomn": "десять",
    "gent": "десяти",
    "datv": "десяти",
    "accs": "десять",
    "ablt": "десятью",
    "loct": "десяти"
  },
  "11": {
    "nomn": "одиннадцать",
    "gent": "одиннадцати",
    "datv": "одиннадцати",
    "accs": "одиннадцать",
    "ablt": "одиннадцатью",
    "loct": "одиннадцати"
  },
  "12": {
    "nomn": "двенадцать",
    "gent": "двенадцати",
    "datv": "двенадцати",
    "accs": "двенадцать",
    "ablt": "двенадцатью",
    "loct": "двенадцати"
  },
  "13": {
    "nomn": "тринадцать",
    "gent": "тринадцати",
    "datv": "тринадцати",
    "accs": "тринадцать",
    "ablt": "тринадцатью",
    "loct": "тринадцати"
  },
  "14": {
    "nomn": "четырнадцать",
    "gent": "четырнадцати",
    "datv": "четырнадцати",
    "accs": "четырнадцать",
    "ablt": "четырнадцатью",
    "loct": "четырнадцати"
  },
  "15": {
    "nomn": "пятнадцать",
    "gent": "пятнадцати",
    "datv": "пятнадцати",
    "accs": "пятнадцать",
    "ablt": "пятнадцатью",
    "loct": "пятнадцати"
  },
  "16": {
    "nomn": "шестнадцать",
    "gent": "шестнадцати",
    "datv": "шестнадцати",
    "accs": "шестнадцать",
    "ablt": "шестнадцатью",
    "loct": "шестнадцати"
  },
  "17": {
    "nomn": "семнадцать",
    "gent": "семнадцати",
    "datv": "семнадцати",
    "accs": "семнадцать",
    "ablt": "семнадцатью",
    "loct": "семнадцати"
  },
  "18": {
    "nomn": "восемнадцать",
    "gent": "восемнадцати",
    "datv": "восемнадцати",
    "accs": "восемнадцать",
    "ablt": "восемнадцатью",
    "loct": "восемнадцати"
  },
  "19": {
    "nomn": "девятнадцать",
    "gent": "девятнадцати",
    "datv": "девятнадцати",
    "accs": "девятнадцать",
    "ablt": "девятнадцатью",
    "loct": "девятнадцати"
  },
  "20": {
    "nomn": "двадцать",
    "gent": "двадцати",
    "datv": "двадцати",
    "accs": "двадцать",
    "ablt": "двадцатью",
    "loct": "двадцати"
  },
  "30": {
    "nomn": "тридцать",
    "gent": "тридцати",
    "datv": "тридцати",
    "accs": "тридцать",
    "ablt": "тридцатью",
    "loct": "тридцати"
  },
  "40": {
    "nomn": "сорок",
    "gent": "сорока",
    "datv": "сорока",
    "accs": "сорок",
    "ablt": "сорока",
    "loct": "сорока"
  },
  "50": {
    "nomn": "пятьдесят",
    "gent": "пятидесяти",
    "datv": "пятидесяти",
    "accs": "пятьдесят",
    "ablt": "пятьюдесятью",
    "loct": "пятидесяти"
  },
  "60": {
    "nomn": "шестьдесят",
    "gent": "шестидесяти",
    "datv": "шестидесяти",
    "accs": "шестьдесят",
    "ablt": "шестьюдесятью",
    "loct": "шестидесяти"
  },
  "70": {
    "nomn": "семьдесят",
    "gent": "семидесяти",
    "datv": "семидесяти",
    "accs": "семьдесят",
    "ablt": "семьюдесятью",
    "loct": "семидесяти"
  },
  "80": {
    "nomn": "восемьдесят",
    "gent": "восьмидесяти",
    "datv": "восьмидесяти",
    "accs": "восемьдесят",
    "ablt": "восемьюдесятью",
    "loct": "восьмидесяти"
  },
  "90": {
    "nomn": "девяносто",
    "gent": "девяноста",
    "datv": "девяноста",
    "accs": "девяносто",
    "ablt": "девяноста",
    "loct": "девяноста"
  },
  "100": {
    "nomn": "сто",
    "gent": "ста",
    "datv": "ста",
    "accs": "сто",
    "ablt": "ста",
    "loct": "ста"
  }
}